package Homeworks.homework4;

public class Main {

    //   ДЗ 7. ДЗ. 7
//    Необходимо вывести на экран таблицу умножения на 3 с помощью цикла for:
//            3*1=3
//            3*2=6
//            3*3=9
//            3*4=12
//            3*5=15
//            3*6=18
//            3*7=21
//            3*8=24
//            3*9=27
//            3*10=30
    public static void main(String[] args) {
//        for (int i = 1; i <= 10; i++) {
//            System.out.println("3*" + i + "=" + 3 * i);
//        }
//    }

//    ДЗ 5. ДЗ. 5
//    Необходимо вывести на экран вот такую последовательность чисел с помощью цикла while:
//            7 14 21 28 35 42 49 56 63 70 77 84 91 98

//        int i = 7;
//        while (i <= 98) {
//            System.out.println(i);
//            i += 7;
//        }

//        ДЗ 6. ДЗ. 6
//        Необходимо вывести на экран вот такую последовательность чисел с помощью цикла while:
//        1 2 4 8 16 32 64 128 256 512

        int i = 1;
        while (i <= 512) {
            System.out.println(i);
            i += i;
        }
    }
}