package Homeworks.homework3;

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

//        ДЗ 4. ДЗ. 4
//        Необходимо написать программу, где бы пользователю предлагалось ввести число на выбор: 1, 2 или 3, а программа
//        должна сказать, какое число ввёл пользователь: 1, 2, или 3 и в том случаи, если пользователь ввёл какое-либо
//        другое число программа должна отвечать „Вы ввели число не равное 1, 2 или 3“

//        Scanner scanner = new Scanner(System.in); // создаем экземпляр scanner что бы достучаться до класса Scanner
//        System.out.println("Введите число на выбор: 1, 2 или 3");
//        int number1 = scanner.nextInt();
//
//        if (number1 == 1) {
//            System.out.println("Пользователь ввел чило: " + number1);
//        } else if (number1 == 2) {
//            System.out.println("Пользователь ввел чило: " + number1);
//        } else if (number1 == 3) {
//            System.out.println("Пользователь ввел чило: " + number1);
//        } else {
//            System.out.println("Вы ввели число не равное 1, 2 или 3");
//        }

//        ДЗ 3. ДЗ. 3
//        Необходимо написать программу, где бы пользователю предлагалось ввести число 1. Если пользователь ввёл число 1,
//                программа должна вывести сообщение: "Вы ввели число 1". Если пользователь ввёл другое число, программа
//        должна вывести такое сообщение: "Вы ввели число не равное 1"

//        Scanner scanner = new Scanner(System.in); // создаем экземпляр scanner что бы достучаться до класса Scanner
//        System.out.println("Введите число 1");
//        int number1 = scanner.nextInt();
//
//        if (number1 == 1) {
//            System.out.println("Вы ввели число 1");
//        } else {
//            System.out.println("Вы ввели число не равное 1");
//        }

        //        ДЗ 4. ДЗ. 4 попробую сделать через массив
//        Необходимо написать программу, где бы пользователю предлагалось ввести число на выбор: 1, 2 или 3, а программа
//        должна сказать, какое число ввёл пользователь: 1, 2, или 3 и в том случаи, если пользователь ввёл какое-либо
//        другое число программа должна отвечать „Вы ввели число не равное 1, 2 или 3“
//
//
//        Решение с помощью опреатора Switxh

//        Scanner scanner = new Scanner(System.in); // создаем экземпляр scanner что бы достучаться до класса Scanner
//        System.out.println("Введите число на выбор: 1, 2 или 3");
//        int number1 = scanner.nextInt();
//
//        switch (number1) {
//            case 1:
//                System.out.println("Вы ввели число 1");
//                break;
//            case 2:
//                System.out.println("Вы ввели число 2");
//            case 3:
//                System.out.println("Вы ввели число 3");
//            case 4:
//                break;
//            default:
//                System.out.println("Вы ввели не правильное число");
//        }

        //----------------------------------------------------------------------------------------


//        Scanner scanner = new Scanner(System.in); // создаем экземпляр scanner что бы достучаться до класса Scanner
//        System.out.println("Введите число на выбор: 1, 2 или 3");
//        int number1 = scanner.nextInt();

//        int[] array1 = {1, 2, 3};
//        int number1 = array1.length;
//        System.out.println(number1);

//        switch (number1) {
//            case 1:
//                System.out.println("Вы ввели число 1");
//                break;
//            case 2:
//                System.out.println("Вы ввели число 2");
//            case 3:
//                System.out.println("Вы ввели число 3");
//            case 4:
//                break;
//            default:
//                System.out.println("Вы ввели не правильное число");
//        }



//        String [] array1 = {"Java", "is the best"};
//        int number1 = array1.length;
//        System.out.println(array1[0]);

//        int[] array1 = new int[3];
//
//        array1[0] = 5;
//        array1[1] = 17;
//        array1[2] = 350;
//
//        System.out.println(array1[0]);
//        System.out.println(array1[1]);
//        System.out.println(array1[2]);


//        int i = 1;
//                while (i<0){
//                    System.out.println(i+ "");
//                    i++;
//                }


    }
}

