package Mentor.lesson1;

public class Animals {
    /*
Ми маємо хатинку в Карпатах і 5 домашніх тварин: гуски та вівці.
Кількість гусок та овець з цих 5ти тварин невідомо.
Вивести усі комбінації гусок та овець із 5ти тварин, за умовою, що мінімальна
кількість гусок та овець у кожному наборі дорівнює одному. Треба вирішити задачу за допомогою циклів.
Наприклад:
“У хатинці маємо 1 гуску та 4 вівці”
“У хатинці маємо 2 гуски та 3 вівці”
  a) закінчення в словах не змінюється в залежності від
   кількості гусок та вівців
*/
    public static void main(String[] args) {
        int ship = 4;
        for (int i = 1; i < 5; i++) {
            System.out.println("В доме есть " + i + " гуся " + ship-- + " овцы");
        }
/*
 б) змінити закінчення в залежності від числа, яке стоїть перед словом гуска и вівця.
	“В хатинці є 1 гуска и 4 вівці”
	“В хатинці є 2 гускі и 3 вівці”
 */

        System.out.println("                                               ");
        System.out.println("----------------Вариант решения 2--------------");
        System.out.println("                                               ");

        int shipCount = 4;
        for (int i =1; i < 5; i++) {
            String duckOne = "duck";
            String sheepOne = "sheeps";
            if (i > 1){
                duckOne = "ducks";
                if(shipCount > 1) {
                    sheepOne = " sheeps";
                }
                System.out.println("In buildin we have " + i + duckOne + shipCount-- + sheepOne); // надо перепроверить
            }
        }
        // задача 3
        /*
в) Порахувати кількість ніг у кожного із наборів із розрахунку, що гуска має 2 ноги, а вівця чотири
Доповнити висновок на консоль:
“В хатинці є 1 гуска та 4 вівці. Кількість ніг = 18”
     “В хатинці є 2 гуски та 3 вівці. Кількість ніг = 16”
*/



    }

}
